group_IA_id = -4246635872
channel_out_id = -1002066112684

# # 'Для слушания новостей'
# channel_url = [
#     'https://t.me/channelOut2',
#     'https://t.me/meduzalive',
#     'https://t.me/LipsitsIgor',
#     'https://t.me/bdtprb',
#     'https://t.me/tvrain',
# ]


# Для парсинга вчерашних старых сообщений
channels_id = [
    -1002066112684,  # channel_out_id
    -1001036240821,  # meduzalive
    -1001521490869,  # LipsitsIgor
    -1001005031786,  # tvrain
    -1001095950024,  # bdtprb
    -1001324653248,  # ИнфоПовод
]

key_words = [
    "национализаци",
    "мобилизаци",
    "курс доллара",
    "главные новости",
    "главное за",
    "итоги дня",
    "итоги недели",
    "утро на дожде",
]

key_words2 = [
    "главные новости",
    "главное за",
    "итоги дня",
    "итоги недели",
    "утро на дожде",
]

key_words_not = [
    "скидки",
    # "акции",
    # "подписывайтесь",
    "приглашаем",
    "вакансии",
    "зарплата",
]